app/views/diseases/_categorise_disease_index.erb

              <td>
                <% c.large_categorises.each do |large_categorise| %>
---
SELECT `categorises`.* FROM `categorises`
SELECT `large_categorises`.* FROM `large_categorises` WHERE `large_categorises`.`categorise_id` IN (1001, 1031, 1032, 1033)

        <%= label :large_categorises_large_categorise_id, "カテゴライズ分類",class:"control-label" %>
        <% large_category_options = LargeCategorise
                                    .group(:large_categorise_name)
                                    .order(:large_categorise_id)
                                    .map{|c| [c.large_categorise_name, c.large_categorise_id, data: { children_path: large_categorise_categorises_path(c.large_categorise_id) }]}%>
---
SELECT `large_categorises`.* FROM `large_categorises` GROUP BY `large_categorises`.`large_categorise_name`  ORDER BY `large_categorises`.`large_categorise_id` ASC