app/views/diseases/_disease_classify_index.erb

SELECT `disease_classifies`.* FROM `disease_classifies`
---
            <label>分類：</label>
            <%= f.collection_select:disease_classify_id, DiseaseClassify.all, :id, :classify_name,{prompt: ""}, {class:"form-control"}%>