app/controllers/categorises_controller.rb

  def index
    categorises = Categorise.joins(:large_categorises).merge(LargeCategorise.id_in(params[:large_categorise_id]))
    render json: categorises.select(:id, :categorise_name)
---
SELECT `categorises`.`id`, `categorises`.`categorise_name` FROM `categorises` INNER JOIN `large_categorises` ON `large_categorises`.`categorise_id` = `categorises`.`id` WHERE `large_categorises`.`large_categorise_id` = 3