app/controllers/diseases_controller.rb

    def show
        @disease = Disease.find_by(id: params[:id])
        @symptoms = @disease.disease_symptoms.joins([:symptom,symptom: :symptom_category]).includes([:symptom, symptom: :symptom_category]).order("plr desc")
        @categorises = @disease.categorise_disease_relations.includes([:categorise,:large_categorises])
        @classify = @disease.classify_relations.includes(:disease_classify)
---
SELECT  `diseases`.* FROM `diseases` WHERE `diseases`.`id` = 28 LIMIT 1
SELECT `categorise_disease_relations`.* FROM `categorise_disease_relations` WHERE `categorise_disease_relations`.`disease_id` = 28
SELECT `categorises`.* FROM `categorises` WHERE `categorises`.`id` IN (1001, 1031, 1032, 1033)
SELECT `large_categorises`.* FROM `large_categorises` WHERE `large_categorises`.`categorise_id` IN (1001, 1031, 1032, 1033)
SELECT `classify_relations`.* FROM `classify_relations` WHERE `classify_relations`.`disease_id` = 28
SELECT `disease_classifies`.* FROM `disease_classifies` WHERE `disease_classifies`.`id` IN (4, 20)

    def update
        if @disease.update(disease_params)
---
UPDATE `diseases` SET `importance` = 0, `updated_at` = '2016-04-28 03:59:08' WHERE `diseases`.`id` = 28

  def set_disease
    @disease = Disease.find(params[:id])
---
SELECT  `diseases`.* FROM `diseases` WHERE `diseases`.`id` = 28 LIMIT 1