app/controllers/disease_symptoms_controller.rb

SELECT `categorise_symptom_relations`.* FROM `categorise_symptom_relations` WHERE `categorise_symptom_relations`.`categorise_id` = 1001
SELECT `symptoms`.* FROM `symptoms` WHERE `symptoms`.`id` IN (1002, 1029)
---
    def index
        #検索条件による絞込で対象となるdisease_idを配列化。
        @q = Disease.my_diseases(current_user).search(params[:q])
        @diseases_searched = @q.result.map(&:id)
        @diseases_searched.push(0) if @diseases_searched.empty?
        @symptomids = Array.new
        @symptomnames = Array.new
        @month = Date.today.month
        @symptoms_for_select = Symptom.symptom_category_name_and_symptom_name

    #症状を選んだ場合
        if params[:symptom] != nil

            # SQLの検索、及びVIEWselectタグの再セットにex利用
            #　入力項目を優先。
            params[:symptom].values.reject(&:empty?).each_with_index do |value,i|
                @symptomids[i] = value.to_i
            end
            @categorise = params[:q][:categorises_id_eq]

            unless @categorise.empty?
                @symptom_from_categorise = CategoriseSymptomRelation.where(categorise_id: @categorise).includes(:symptom)

SELECT `symptoms`.`symptom_name` FROM `symptoms` WHERE `symptoms`.`id` IN (1002, 1029)
---
            @symptomids.delete(0)
            @symptomids.uniq!
            #名前の検索
            @symptomnames = Symptom.where(id: @symptomids).pluck(:symptom_name)

SELECT  `disease_symptoms`.* FROM `disease_symptoms` WHERE `disease_symptoms`.`id` = 159 LIMIT 1
---
    def set_disease_symptom
        @disease_symptom = DiseaseSymptom.find(params[:id])