app/controllers/hospitals_controller.rb

INSERT INTO `hospitals` (`name`, `login_id`, `department_id`, `password_digest`, `created_at`, `updated_at`) VALUES ('kezuka', 1111, 1, '$2a$10$xgKZRGkdfc.m3NKXIXz7C.F6bbyiWgJwkxBKesYOWCE15gGZ1r33i', '2016-04-28 01:42:35', '2016-04-28 01:42:35')
---
  def create
    @hospital = Hospital.new(hospital_params)
    if @hospital.save

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` IS NULL LIMIT 1
---
  def set_hospital
    @hospital = Hospital.find(params[:id])