app/controllers/sessions_controller.rb

  def create
    @hospital = Hospital.find_by(login_id: params[:session][:login_id])
---
SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`login_id` = 1111 LIMIT 1