app/views/disease_symptoms/index.html.erb

      <%= f.label :onset_cont, "発症様式",class:"control-label" %>
      <%= f.collection_select :onset_cont,
                              Onset.all,
                              :onset_name,
                              :onset_name,
                              {:include_blank => true} ,{:class => "form-control"}%>
---
SELECT `onsets`.* FROM `onsets`

      <%= f.label :disease_classifies_id_eq, "病気分類",class:"control-label" %>
      <%= f.collection_select :disease_classifies_id_eq,
                              DiseaseClassify.all,
                              :id,
                              :classify_name,
                              {:include_blank => true} ,{:class => "form-control"}%>
---
SELECT `disease_classifies`.* FROM `disease_classifies`

        <%= f.label :large_categorises_large_categorise_id_eq, "カテゴライズ分類",class:"control-label" %>
        <% large_category_options = LargeCategorise
                                    .group(:large_categorise_name)
                                    .order(:large_categorise_id)
                                    .map{|c| [c.large_categorise_name, c.large_categorise_id, data: { children_path: large_categorise_categorises_path(c.large_categorise_id) }]}%>
---
SELECT `large_categorises`.* FROM `large_categorises` GROUP BY `large_categorises`.`large_categorise_name`  ORDER BY `large_categorises`.`large_categorise_id` ASC

        <%= f.label :categorises_id_eq, "カテゴライズ",class:"control-label" %>
        <% categorises = Categorise.all ||[]%>
---
SELECT `categorises`.* FROM `categorises`